#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # local_file.setup_complete will be created
  + resource "local_file" "setup_complete" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./SETUP_COMPLETE.md"
      + id                   = (known after apply)
    }

  # local_file.ssh_private_key will be created
  + resource "local_file" "ssh_private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./vault-ssh-key.pem"
      + id                   = (known after apply)
    }

  # local_file.ssh_public_key will be created
  + resource "local_file" "ssh_public_key" {
      + content              = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQYeJCQQ8yVwi7n/u2cS4YFz3lJWdY4URg0zyLFbDeAk1+P20/NWuEdNAk2S2wSVfAgJr6CcqOzhyMxTD95irqq40370dMv72NLnALuB10fptYAAjDrA81gpg032jt2PQGncfHl9fHJ2RamqV1b0mQQnkZanMvsGbqwSLdHot1LcZNLaKzCKsKzlyfhvla5URL1oxj3UdEdpCu6rPOpyqg2mrnGvVDsz+Cb/lKTvF33FK5bofWrakbMBjaGJAB2FIULFJWXVAPZ97njJB50I4BaEYESKRW2x5sWDW8xvenkg6fan1PJ5eDqCUgn7v3U+LA+eMN9+V8oNAa2j9nlPftv1Rd6XtvzCcfv5Ak4Zqqj1FUG0W0vGjuOCagGJmsAQzaLifWdCMz26p7m4s1IItcYKUO9zXMHBv4iJug68VkiVeLJfvqJ7rh1+BdSkRjCdjC93ikD6ooVxi+r25mT5/ClRkWauHaxNhm5p8IKpM0qR4zfOVZ0IF0gNszqCFPYIBu/EMr5hwU9r6iGY1Jm8V+FF6qlq14ggxtHUhfiD5/laftST6qx3SijDC2CZo1P6W0Nhc5D+sP5NnqOtrkxBtQ0g7XQORxD3Ww50t06HeoPLlLLQhJ/EZzSi+l0ij0Z9UIo48jQUIqLoDr+UgUouLQTXdsoyLm5EY0AU0lR+me9Q==
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./vault-ssh-key.pub"
      + id                   = (known after apply)
    }

  # vault_jwt_auth_backend_role.github_actions["apply-dev"] will be updated in-place
  ~ resource "vault_jwt_auth_backend_role" "github_actions" {
        id                           = "auth/jwt/role/tf-github-actions-role-apply-dev"
      ~ token_ttl                    = 900 -> 600
        # (25 unchanged attributes hidden)
    }

  # vault_jwt_auth_backend_role.github_actions["apply-prod"] will be updated in-place
  ~ resource "vault_jwt_auth_backend_role" "github_actions" {
        id                           = "auth/jwt/role/tf-github-actions-role-apply-prod"
      ~ token_ttl                    = 900 -> 600
        # (25 unchanged attributes hidden)
    }

  # vault_jwt_auth_backend_role.github_actions["plan-dev"] will be updated in-place
  ~ resource "vault_jwt_auth_backend_role" "github_actions" {
        id                           = "auth/jwt/role/tf-github-actions-role-plan-dev"
      ~ token_ttl                    = 900 -> 600
        # (25 unchanged attributes hidden)
    }

  # vault_jwt_auth_backend_role.github_actions["plan-prod"] will be updated in-place
  ~ resource "vault_jwt_auth_backend_role" "github_actions" {
        id                           = "auth/jwt/role/tf-github-actions-role-plan-prod"
      ~ token_ttl                    = 900 -> 600
        # (25 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 0 to destroy.

```

</details>

*Pusher: @ATIC-Yugandhar, Action: `pull_request`, Workflow: `Terraform PR Check`*